20211125145059-polls_aggregator.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-12 Mon 11:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Predict the result of French elections</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Predict the result of French elections</h1>
<p>
Sorry but this is a very rough draft written for myself.
</p>

<p>
See <a href="20211207101052-forecasting_elections_in_multiparty_systems_a_bayesian_approach_combining_polls_and_fundamentals.html#ID-4fd036f0-8812-411d-bd25-acd1ebefb7d9">Forecasting elections in multiparty systems: a Bayesian approach combining polls and fundamentals</a>
</p>

<div id="outline-container-org5a69511" class="outline-2">
<h2 id="org5a69511"><span class="todo TODO">TODO</span> Link Gaussian process to stochastic processes</h2>
</div>
<div id="outline-container-orgb73ed11" class="outline-2">
<h2 id="orgb73ed11"><span class="todo TODO">TODO</span> Make the gaussian process work with a non-diagonal covariance matrix</h2>
</div>

<div id="outline-container-org2674a6e" class="outline-2">
<h2 id="org2674a6e">Introduction</h2>
<div class="outline-text-2" id="text-org2674a6e">
<p>
Dimensions:
</p>
<ul class="org-ul">
<li>Elections \(e = 1, \dots, E\)</li>
<li>Parties \(p = 1, \dots, P\)</li>
<li>Pollsters \(h=1, \dots, H\)</li>
<li>Time \(t = t_0-N, \dots, t_0\)</li>
</ul>

<p>
Latent variables:
</p>
<ul class="org-ul">
<li>Intercept with polls \(\iota\)</li>
<li>Latent party \(p\) popularity at day \(t\) with polls: \(\mu_{p, t}\)</li>
<li>House effect for model with polls \(\alpha_k\) where \(k=1, \dots, n_{pollsters}\)</li>
<li>Intercept with results and fundamentals \(\tilde{\iota}\)</li>
<li>House effect for model with results and fundamentals \(\tilde{\alpha}_k\)</li>
<li>Poll biais (what is this?)</li>
<li>Latent party \(m\) popularity at day \(t\) with fundamentals: \(\tilde{\mu}_{m, t}\)</li>
</ul>

<p>
We integrate two different models:
</p>
<ul class="org-ul">
<li>A model that aggregates polls and tries to infer the "true" intentions</li>
<li>A model that uses fundamental data to predict the results on election days</li>
<li>Both models are integrated as we relate the results to the "true" intention at time \(T\) of the election, which is connected to the intentions at previous time steps.</li>
</ul>

<p>
We use Gaussian processes to model the time evolution of the different parameters. However:
</p>
<ul class="org-ul">
<li>We use 1D gaussian processes, one for each party where we could use a multidimensional GP with a dense covariance matrix instead (and thus model the 'transfers');</li>
<li>We use the <a href="20211129163720-squared_exponential_kernel.html#ID-338df7ae-048d-4a93-861b-80f75c3b887e">Squared exponential kernel</a> but the <a href="20211129200726-gaussian_noise_kernel.html#ID-1a08425d-1fa8-4f9f-98d0-423b0d5c0991">Ornstein-Uhlenbeck kernel</a> should be more adaptated as a stochastic process. We could also try a non-stationary kernel as the <a href="20211129201642-wiener_kernel.html#ID-dc211cf2-78b4-4269-91e8-fc88fb49def5">Wiener kernel</a> (I don't see why the distribution should be stationary here)</li>
<li>The value of the parameter is the sum of three parameters modeled by GPs with different timescales. <i>Can we do better than this?</i></li>
</ul>
</div>
</div>


<div id="outline-container-orgb546842" class="outline-2">
<h2 id="orgb546842">Intercepts</h2>
<div class="outline-text-2" id="text-orgb546842">
\begin{align*}
  \sigma_{\iota} &\sim \operatorname{HalfNormal}(0.5)\\
 \iota_{e,p} &\sim \operatorname{ZeroSumNormal}(0, \sigma_{\iota})
\end{align*}

\begin{align*}
  \sigma_{\tilde{\iota}} &\sim \operatorname{HalfNormal}(0.5)\\
 \tilde{\iota}_{p} &\sim \operatorname{ZeroSumNormal}(0, \sigma_{\tilde{\iota}})
\end{align*}
</div>
</div>

<div id="outline-container-orgf6d094b" class="outline-2">
<h2 id="orgf6d094b">House effect</h2>
<div class="outline-text-2" id="text-orgf6d094b">
<p>
The systemic poll biais shared by every pollster for each political party:
</p>

\begin{equation}
 \zeta_{p} \sim \operatorname{ZeroSumNormal}(0, 0.15)
\end{equation}

<p>
The house effet per party
</p>

\begin{equation}
 \epsilon_{h,p} \sim \operatorname{ZeroSumNormal}(0, 0.15)
\end{equation}

<p>
And the house effect per (election, party)
</p>

\begin{align*}
  \sigma_{\tilde{\epsilon}, h, p} &\sim \operatorname{HalfNormal}(0.15)\\
 \tilde{\epsilon}_{h, p, e} &= \sigma_{\tilde{\epsilon}, h, p} \;\operatorname{ZeroSumNormal}(0, 1)
\end{align*}
</div>
</div>

<div id="outline-container-org94d1d94" class="outline-2">
<h2 id="org94d1d94">Fundamental data</h2>
<div class="outline-text-2" id="text-org94d1d94">
<p>
Idea that elections are simple to predict using fundamental data. Here we model the unemployment effect \(\nu_u\):
</p>

\begin{equation}
 \nu_u \sim \operatorname{ZeroSumNormal}(0, 0.15)
\end{equation}
</div>
</div>

<div id="outline-container-orgc43a2ca" class="outline-2">
<h2 id="orgc43a2ca">Time evolution</h2>
<div class="outline-text-2" id="text-orgc43a2ca">
<p>
We model the time evolution of parties' latent popularity with 3 gaussian processes with different length scales to catch the different time scales of the process.
</p>
</div>
</div>

<div id="outline-container-org0f2e1fe" class="outline-2">
<h2 id="org0f2e1fe">Combine the factors</h2>
<div class="outline-text-2" id="text-org0f2e1fe">
</div>
<div id="outline-container-orgd90d7bc" class="outline-3">
<h3 id="orgd90d7bc">Poll aggregator</h3>
<div class="outline-text-3" id="text-orgd90d7bc">
\begin{equation}
 \lambda_{h, t, e, p} = \tilde{\iota}_{p} + \iota_{e,p} + \mu_{t,p} + \tilde{\mu}_{t,e,p} + \zeta_{u} \; U_{t} + \zeta_{p} + \epsilon_{h,p} + \tilde{\epsilon}_{h,p,e}
\end{equation}

<p>
We then note the vector \(\mathbf{p}_{h, t, e} = \left(p_{h,t,e,Green}, \dots, p_{h,t,e,Left}\right)\) and write
</p>

\begin{equation}
\mathbf{p}_{h, t, e} = \operatorname{Softmax}(\lambda_{h, t, e})
\end{equation}

<p>
The latent popularity is given by removing the house effects &amp; poll biases:
</p>

\begin{equation}
 \mathbf{p}^{latent}_{h,t,e} = \operatorname{Softmax}\left(\tilde{\iota}_{p} + \iota_{e,p} + \mu_{tp} + \tilde{\mu}_{t,e,p} + \nu_{u} \; U_{t}\right)
\end{equation}
</div>
</div>


<div id="outline-container-orge62582c" class="outline-3">
<h3 id="orge62582c">Fundamentals model</h3>
<div class="outline-text-3" id="text-orge62582c">
\begin{equation}
 \tilde{p}_{h, t, e, p} = \operatorname{Softmax}\left(\tilde{\iota}_{p} + \iota_{e,p} + \mu_{t_0,p} + \tilde{\mu}_{t_0,e,p} + \nu_{u} \; U_{t_0}\right)
\end{equation}
</div>
</div>
</div>


<div id="outline-container-org0bb6e8e" class="outline-2">
<h2 id="org0bb6e8e">Connect to poll results and election results</h2>
<div class="outline-text-2" id="text-org0bb6e8e">
<p>
The concentration parametrer:
</p>

\begin{equation}
 \alpha \sim \operatorname{InverseGamma}(1000, 100)
\end{equation}

<p>
We note \(n_{h, p, t, e}\) the result of a poll at time \(t\) for party \(p\), and \(N_{t}\) the number of respondents:
</p>

\begin{equation}
 n_{h, p,t, e} \sim \operatorname{DirichletMultinomial}(\alpha\,p_{hpte}, N_{t})
\end{equation}

<p>
We note \(r_{pe}\) the result for party \(p\) at election \(e\), \(R_e\) the number of voters and we write
</p>

\begin{equation}
  r_{pe} \sim \operatorname{DirichletMultinomial}\left(\alpha\;\tilde{p}_{pe}, R_{e}\right)
\end{equation}

<p>
Q: <i>What if there are several polls in one day?</i>
</p>
</div>
</div>

<div id="outline-container-orgc9be739" class="outline-2">
<h2 id="orgc9be739">Links to this note</h2>
</div>
</div>
</body>
</html>